#### cut(): method used to convert continous variable to categorical variable
- binning, making diff categories, like for age giving intervals

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame({'Age': np.random.randint(1, 100, 10)})
df

   Age
0   70
1   90
2   92
3   40
4   99
5   94
6   92
7    1
8   95
9   66

In [3]:
df["category"]=pd.cut(x=df['Age'], bins=[1, 20, 40, 60,80, 100]) 
# this command creates bins accross the numbers correspondingly
df

   Age       category
0   70   (60.0, 80.0]
1   90  (80.0, 100.0]
2   92  (80.0, 100.0]
3   40   (20.0, 40.0]
4   99  (80.0, 100.0]
5   94  (80.0, 100.0]
6   92  (80.0, 100.0]
7    1            NaN
8   95  (80.0, 100.0]
9   66   (60.0, 80.0]

In [4]:
df["age_category"]= pd.cut(x=df['Age'], bins=[1, 20, 40, 60,80, 100],labels=["kids","Young","mid-age","Old","very-old"])   
df

   Age       category age_category
0   70   (60.0, 80.0]          Old
1   90  (80.0, 100.0]     very-old
2   92  (80.0, 100.0]     very-old
3   40   (20.0, 40.0]        Young
4   99  (80.0, 100.0]     very-old
5   94  (80.0, 100.0]     very-old
6   92  (80.0, 100.0]     very-old
7    1            NaN          NaN
8   95  (80.0, 100.0]     very-old
9   66   (60.0, 80.0]          Old

#### loops in the data frame

In [5]:
info = pd.DataFrame([[1,2,3],[4,5,8],[34,56,78]],columns = ['col1','col2','col3'])  
info

   col1  col2  col3
0     1     2     3
1     4     5     8
2    34    56    78

In [6]:
for i in info:  ## gives column names
    print(i)

col1
col2
col3

In [7]:
for row_index,row in info.iterrows():  
    print (row_index,row)

0 col1    1
col2    2
col3    3
Name: 0, dtype: int64
1 col1    4
col2    5
col3    8
Name: 1, dtype: int64
2 col1    34
col2    56
col3    78
Name: 2, dtype: int64

In [8]:
#in entire df only col 1 and 3's entry is req
for row_index,row in info.iterrows():  
    print(info[["col1","col2"]].iloc[row_index])

col1    1
col2    2
Name: 0, dtype: int64
col1    4
col2    5
Name: 1, dtype: int64
col1    34
col2    56
Name: 2, dtype: int64